[{"id": "8z1jng", "stockTicker": "TSLA", "title": "$TSLA Meltdown on Twitter", "selfText": "", "score": 5, "comment": "F[deleted]Oooo looks like Uncle Chanos woke up /u/Old_Bit early to get his anti-Tsla submissions going early this week. \n\nHere's what's gonna happen:\n\n> Old_Bit refers to Elon Musk as \"Enron Musk\"\n\n> Old_Bit submits 10 more anti-tsla articles/memes on a sunday, likely stolen from the circlejerk of tsla shorts on twitter\n> \n> Old_Bit gives uncle Chanos a sponge bath\n> \n> Old_Bit returns to comments, throwing *REEEE ATTACKS YOU FUCKING ASSHOLE SO STUPID CAN'T EVEN [do something finance-related] YOU'RE SO FUCKING DUMB* in a very autistic manner until Auntie Chanos clears the space around him and reminds everyone to not get close or try and contain his flailing spaghetti arms.\n> \n> If anyone has a typo, error or miscommunication in their response, Old_Bit shall focus entirely on that (instead of debate at hand) and repeat the above autistic attacks.\n\n> If anyone proceeds to debate his thoughts, he'll last about one reply before digressing with ad hominem attacks \n\n> And I'd say the number one sign of a wasted mind: Dismissive rather than discussion. \"If I don't understand this using this specific perspective lens, everyone else is wrong and they're also cultists/cucks\". Which is humorously similar to Clarke's Third Law: \n*Any sufficiently advanced technology is indistinguishable from magic.* (Except in this case technology is the modern stonk markets. And \"magicians\" are the modern retail & tech investors.)Ban this overly obsessed anti-musk loserReading twitter posts on bout this, basically surmount to: a CEO being a Republican is basically equivilent to be a Nazi. [removed]AImagine unironically being a communist I have never noticed /u/old_bit but after going through his post history, holy shit this is spot on.you know what, I am not even going to respond to your personal attacks, I will be glad when you go pauper soon when Tesla files chap 11. \"Value Investing\", my ass.This isn't a safe space like the cucks over at /r/latestagecapitalism. We do things the right way, we mock people we don't like until they stop posting. https://i.imgur.com/niGrwTq.jpg GThat's the funny thing about social media manipulation (at any level: penny stocks, world's most shorted company, celebrity PR, national/presidential level)... You don't have to be right, you just have to be loud and trigger some sort of dormant-pseudo-emotion in your reader. Ey man I'm always happy to engage in discourse with opposing thoughts. It's the best way to learn.\n\nBut you're a well-read guy who's gotta focus away from the bottom-two levels of the [Hierarchy of Disagreement] (https://upload.wikimedia.org/wikipedia/commons/7/7c/Graham%27s_Hierarchy_of_Disagreement.svg) >... says isn't going to respond\n\n> goes on to respond a lot https://i.imgur.com/Cp7im5T.jpg GLogic at it's finest. I personally am taking summer semester tests on this type of material, shits hilarious to see here. Lol. Fallacious to say the least. Lolyou dont \"disagree\" with people investing in obvious frauds like Tesla or theranos. You just leave, they are not worth discussing.YOLmfao why are you even mentioning theranos in this?Dyou will see soon and I will be laughing at  you for rest of my life.I don't carry such resentment. I just wish you would engage in more discussion without resorting to name calling. Even if TSLA tanks I'll turn out A-OK. ", "linkFlairText": null, "totalAwardsReceived": 0}, {"id": "kxb0ds", "stockTicker": "GME", "title": "$GME YOLO: entire Roth in OTM puts. Something about 5,000 bona fide retards pumping a retailer got me in a shorting kinda mood", "selfText": "", "score": 18, "comment": "Thank you! We appreciate your sacrificeThank you for your donationI see someone hates money.You’re going to get slaughteredHoly fuck you’re about to literally lose your life savingsYou have a Roth to lose.\n\nWe have nothing to lose.\n\nYou fight for profit, perhaps. We fight because there is nothing behind us but a cliff.Lol you are so fuckedYou could of donated that money to sick children instead of burning it.Calling people retards while lighting piles of cash on fire and pissing on them with the tiniest dick everHow actually retarded are youThanks for sharing your money with the rest of us 🌈🐻Claims stock is only printing $$$$ because of WSB retard pump.\n\nMakes a play that stock will falter during biggest pump of stock\n\nThen proceeds to post position on said sub to try and incite anger amungst the retards pumping said stock - working directly against his posted positon.\n\nWelcome, you truly are retarded.\n\n!Remind Me: 3 MonthsYou are special kind of retard????Ban get out of hereLol you guys are so fucking retarded, GME is now returning to proper market value based on the fact that they clearly aren’t going bankrupt, they have the golden god of e-commerce running the company, and the console cycle, why the fuck are you buying puts.  You guys just tell on yourself with this dumb shitNo one tell him what happens when iv drops 100%.\nBye bye RothRIP\n\n!RemindMe April 15th 2021 6:29 AM PSTBro wtffff whyyy😔You’re fuckedLosses in April or ban.Enjoy working until you die.You get what you fucking deserveI'll enjoy watching these crumbleAt least he can only lose $11,720. Not like he solid calls, which would've been even more stupid.Why do you hate money?I’m a contrarian trader and love shorting high flying stuff, but the IV means it really has to fall hard and fast. Ideally you would short shares with some calls to protect you from the squeeze but there are no shares to borrow. So you’re really fighting the flow on this one.If you did the reading, understood the company, understood the various directions GME could take on its new path, and having weighed it up decided that the bearish case still significantly outweighed the bullish case, this is a reasonable YOLO.\n\nBut I don’t think you did.Dude get out right now at least wait until IV settles why are you doing this I genuinely don’t want you to lose moneyat least you have the balls to put the money up and actually post puts. Respect but you still dumbIm a GME gang and bullish but man i respect you retard. Ill meet you on the battlefield and slaughter you.BRO YOU ARE GOING TO BE BROKE READ THE ROOM HOLY SHITHi MelvinThat’s it, Forrest!you deserve whats coming to you. \n\nwhat?! gamestop employees dont have a right to have a job and live?! scum bagRIPThank you for your service.lmfao. Thx for the free moneyDo you know what’s IV?IV GONNA FUCK YOU LMAODon't let nu-wsb get you down. Bears and Bulls make money, pigs get slaughtered.This post was flaired as a YOLO so it's on the YOLO list. [Find more YOLOs here!](https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da)\n\nHey /u/Planningsiswinnings the YOLO flair is for big dick trades that you're already in. If you misused the flair please change it. Mods have been notified of this thread.\n\n[Submission Flair Guide](https://www.reddit.com/r/wallstreetbets/wiki/linkflair)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*Gay bear alert.I get wanting to be contrarian to the market, and sure, GME will eventually come back down, but it hasn't even peaked. \n\nThis thing is shorted to the tits, and WSB is collectively pumping it up, the short squeeze is gonna be massive. \n\nTiming it is difficult, but you are gonna lose all your money, or like...just most of it.burning moneyYou will pay for this...literallyBuying puts that will expire worthless is a nice trick to avoid death to IV crush.\n\nOutstanding move!Your 14k will soon be 0 my guy!!Looks like u will not be retiring earlyOh dear...Yes it night bounce down, but all eyes are on gme and everyone is salivating to buy any dips, Goodluck bro u will need it, if your sausage so big why didn't you buy these ahead of squeeze?How’s that going for you?Honestly, I feel sorry for this dude. All the DD coming to fruition and he still doesn't join in on the cause. Good luck though.Finally someone with a brain 🧠I trullt hope to bath in the blood of this dudeHis move is purely ego defense...but of the highest order. When you miss out on a play, most people just deride it...our gun over here spite-pissed his money away on top of that.LOL I’ve angered the hive... keep buying calls on the video game retailer, the exponential growth will surely continue forever!!!This man squared up to Ryan Cohen and is about to get slapped in the face with his dickNo🚀🚀🚀Is retardation not a sickness?Literally the dumbest play I've ever seen. Even if it drops to $20 before expiry iv crush is gonna blow up his roth.No think this guys is classified as stupid the rest of us are tardsI'm on gme gang now but still im calling out retards like you. You don't get banned for being a bear get that through your fetus lurker noob smooth brainIt’s up 200% this month and holding near a $40 floor, more tendies for everyone elseWhat do you consider proper valuation as the last time GME traded over 45$ was in like 2013.I will be messaging you in 3 months on [**2021-04-15 14:29:00 UTC**](http://www.wolframalpha.com/input/?i=2021-04-15%2014:29:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/kxb0ds/gme_yolo_entire_roth_in_otm_puts_something_about/gj93i98/?context=3)\n\n[**7 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fkxb0ds%2Fgme_yolo_entire_roth_in_otm_puts_something_about%2Fgj93i98%2F%5D%0A%0ARemindMe%21%202021-04-15%2014%3A29%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20kxb0ds)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|Check out LMND. I’m short 800 shares here. Citron pumping out a bearish tweetstorm at 10:30a est tomorrowValid points. I shorted PLTR under similar circumstances a few weeks back. The stock fell 30% and the puts rose a similar amount, so it hardly felt worth the risk, but it feels good to be right once in a while. I realize I could be right and still lose money hereNo it’s not us I swearYes but I haven’t resorted to intravenous drugs yet, thank you for your concernShe sounds hotMy backup plan is to be dead by 4/16 (points at brain)Has more come out? Should I buy in?Okay MelvinName a time and place big boyI’d be happy to post my PLTR put gains from a few weeks back but no, I don’t take pleasure in other people losing money. Keep buying meme stocks if that’s your thingDude...read the fuckin' roomAnyone quoting GME's business as the primary reason behind the move is an idiot. They've done alright given their situation, but the short squeeze from institutions betting poorly is what's driving it up right now.Wait till this guy hears about omnichannel, streaming, electronic downloads, etcCalling them a video game retailer is so ignorant, first of all, like Tesla, when you have a once in a generation type genius in charge you are investing as much in the person as the company and their products, and secondly Ryan Cohen is going to completely rebuild the business for the digital age, 35-40 is the new floorFrom an options standpoint your break even is around $17. The IV is 170% and delta is only .1. There is support around the 17-18 range. Your best bet is GME crashes in Feb and March, and even then you can lose value in IV for not a lot of delta. \n\nWhy jump in front of the moving train this early?The hive mind is the strength of the sub though?  It is a dumb thing when people pile on insults or something but when everyone is ponying up ducats it honest to god affects the market. There was a post here a couple days ago that did the math on the combined might of WSB autists and it rivals some of the biggest institutional players when the horde is pointed in the right direction.They call that a Mushroom Tattoo in these partsAHHAAAHAHH BAI BAI MONEYLol really is a yolo 😂you only lose it all onceI genuinely hope you make a ton of $$$$$Remind me! 14 daysIdk ask your doc cause this is a retarded playGood point.My smooth brain only knows stonks go up 🚀At least you bought far out to minimize IV. But yeah it’s hard to short this stock right now, so it’s a tough one for me. I’ve also been burned on short squeezes before. And in my 15 years of trading, GME right now looks like one of those once in a lifetime events. Never seen short interest this high.Please don't joke about thatI think the squeeze will genuinely start next week.Shorts still haven’t covered even with that last run, and that run is gonna force their hand this next week. This is going to $100 at the least, possibly $420.69 if enough people diamond hand it7:00 behind Wendy's as soon as I get off shift.Immediate defensive attitude clearly shows insecurity with being a 🌈🐻.  PUTS ON THIS 🐻🌈 OP.You literally just dumped your life savings betting on a meme stock retard.Stfu the whole point is to make money with risky trades not only sticking to bullish plays.watch the market shift in a year and retards like you are gonna get ass fucked on every play.  \nBe Autists\nNot RetardsI’m having deja vu, stock down 10% and puts up 9%For the record I meant it in a sexual way, not aggressiveNo, just the Roth. And I’ll fucken do it again!!\n\nThe only people being derided on wsb are those who challenge the hive mind. That should worry youIt’s fine I will get lots of sexual pleasure jerking it to your poss porn.Lol we’re deriding you because it’s fucking stupid play that’s gonna lose you thousands of dollars. This is you thinking you’re some kind of edgy genius betting against the mainstream.Poss?500 gme shares 17.50 avg.", "linkFlairText": "YOLO", "totalAwardsReceived": 0}, {"id": "kohip1", "stockTicker": "NVDA", "title": "$NVDA is about to blow up and I’m tired of no one talking about it", "selfText": "You heard right. I’m tired of you GME PLTR losers sucking each other off. I come to you you with a real fucking winner here. \n  \nNVDIA has been consolidating for 3 fucking months, getting tighter and tighter and this baby is ready to pop. All time highs were at 580 and it’s only at 520. It can get to 580 in to days when this baby blows. And we all know this is easily an $1000+ stock.\n\nTLDR: $NVDA 520c 01/22/21", "score": 16, "comment": "Also, this post contains no useful information other than the fact that you've been bagholding for 3 months.NVDA is also over $500 a share and options costing $1,000-5,000+ for one contract. Foh, most of us work Wendy’s sirSo your DD is it's been going down for 3 months so it should go up now? Where da fuk are the mods at?nvidia had been stuck at $ 500 since jesusThat was almost an entire paragraph, I’m all inNVDA is also going to be partnering with multiple car companies including Mercedes to program AI into the cars for self driving and stuff. This could start as soon as 2022. Easily a 1000+ companyMy 1/15 600c that I got mid Dec are totally fucked.The fukin comments just show how people should learn technicals , Amazon has the same exact chart and blew up for two days . I was fortunate to buy the low point before Amazon broke out of its wedge and that’s what this autist  is talking about . With Amazon I turned a few contracts worth 350 into nearly 3000 because they were dirt cheap , the contracts are turning cheap with Nvidia and its in a tighter wedge than your face mask and cheesy upper lip. Nvidia news is coming , it’s going to be epic for a day or two and give some lucky people a chance to make a thousand percent plays once it breaks out of the wedge .[deleted]PLTR $10000000You’re right.  590 calls looking very juicy at this point.  Might get in on Monday.  😂Hey, hate to break it to you buddy, but NVDA more than doubled in 2020.Nah dude this stock has fcked me so much since 9/02. Not touching it until it passes 540.Probably, cuz I just sold the rest of my NVDA to load up more PLTRNvidia has massive supply problems right now. For once its a real problem that affects the stock price. They will grow again, when they solved it.IDK man, NVDA is milking the monopoly on GPGPU where they have massive margins.\n\nAMD is coming strong and Xilinx has given them more tec on die connectivity that is key for large scale stuff.\n\nNVDA is going to have competition in the datacenter, and Mamma Su has been sharpening the axe.\n\nGLGot some 640c 01/13/21 down 99.84%\n.. I'm in you fucker.He said to instead of two like a legitimate retard. I'm all in. 🚀🚀🚀🚀🚀🚀🚀AMD is a better buy at this pointWas looking at this play Thursday as well but didn’t want to hold through the long weekend. Seems to hit some clear resistance around $516 and could go to $550 easily with earnings around the corner**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**NVDA**|**$520**|**BUY CALL**|**2021-01-22**|**$18.85**|**$522.2**|**2411**|**169**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckjeoypbpgrkw0703sj1ijgly) | [Track Record](https://www.pickmojo.com/user/TheMouse1000C/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**Speaking of NVIDIA, have they fired their lunatic director of machine learning research after her Twitter shit hit the fan or that bitch is still working for the company. Because if it's the latter, I have a great feeling we'll see something like that happen in the future (or her shit venting would backhit them in some other way) and the market would sell instantly. Oh wait, she did delete her pathetic Twitter account but what's once been posted online stays out there forever (thank lord for that).\n\nEither way, $NVDA has a time bomb on their hands and I'm not touching their stuff until they come clean. Too much of a risk.\n\n[https://archive.fo/QT3X7](https://archive.fo/QT3X7)My 520 call was $2k and if nvda runs up to only 540 it doubles. Nvda share price moves fast by large amounts easily.OP informs us out of the goodness of his heartBan!No rocket emojis?Im praying to tendie god for NVDA to reach 530 next week or i’ll be eating out of trash cansIf i remember correctly, there’s an event on Jan 12th. We all remembered what happened last event when they announced the RTX 3080 😛I've got $700 June calls, so I hope so. It's been wrecking my gains for the past week.Feb 540c looks nice too.  MaybeNVDA and AMD are extremely over stretched. \nIntc will be the real winner and comeback story of 2021. Screen shot this bitch.*two days, not to days. \n\nIf you're not going to leave any interesting DD at least spell your shit right. \n\nShort NVDANot sure how he typed this out.   \n\nWith his hands busy holding all those bags.\n\nI thought he might of used talk to speech  but that is hard to do with a mouth full of dicks.Don’t have to bag hold to see a stock is in a break out zoneI bought the call Wednesday def not bagholding. I just know the suckers about to popanyone telling us to buy an option that cost over 200$ should be banned. wtf u think im made of money or something .It’s been consolidating for 3 months around the same price range not going down lmaoHey man, I laughed so fucking hard at thisExactly, these ppl make me think I’m crazyDo you think AMZN will break out again?Tell that to teslaThis!Beginning of September is when everything got clappedLol I think ur fuckedWtf is wrong with her\"Nvda share price moves fast by large amounts easily.\" No shit Sherlock530 easy I thinkI think it’s doable. Let us prayRemindME! 3 days “Nvda”RemindME! 365 days \"INTC?\"I believe you are correct sir!Haha. Have my upvote. 😂No DD, just 'trust me bro'I understand. I think NVDA is great. But if you're going to post, back it up with research and data. No one will (or should) just trust your random opinion. And without useful information, it just comes across as a lame pump attempt.what are some good 200$ wsb type of option plays  currently? tired of staying away from optionsSpreads my man, spreadsSo buy a call debit spreadSounds like poor people problemsJust about enough time before shareholders have had enough of having 0 gains so they all start selling off\n\nNVDA 400P 1/15Nah man, I’ve been watching Amazon for a move and now it’s awesome to see Nvidia have the same wedge . Great opportunity coming up , thanks for positing 👍Definitely, earnings is coming up in a month so there’s going to be a moment when it starts a uptrend for the earnings report , earnings day might end up being a correction if it goes up too much or it could be the day it goes crazyLegit all my tsla gains got destroyed when i put it in nvda calls lolI dunno what her mental problem was, but these were the questions that should've been raised by NVIDIA a long time ago.It better or ima start packing my shit up outta the apartmentRemindME! 39 days “nvda?”I will be messaging you in 3 days on [**2021-01-04 19:45:48 UTC**](http://www.wolframalpha.com/input/?i=2021-01-04%2019:45:48%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/kohip1/nvda_is_about_to_blow_up_and_im_tired_of_no_one/ghr39j5/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fkohip1%2Fnvda_is_about_to_blow_up_and_im_tired_of_no_one%2Fghr39j5%2F%5D%0A%0ARemindMe%21%202021-01-04%2019%3A45%3A48%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20kohip1)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|Trust me bro apple making m1 chips and killing amd/nvidia/intel is good bro stock up big bro rocketssNvda programming the AI for multiple car companies including mercedezWdym people literally post the dumbest DD on meme stocks here all the tomeLeap calls for June on MT....or safer bet, ICLNCheck out Best Buy.\n\nEarnings late February. They’ve been getting murdered the past month for no real reason.Fuck yea I’m poor, dafuc kind of retarded response is that. You think if I was rich I’d be taking advice on WSB? No! I’d go to an actual stockbroker like a sane person. Instead, here I am yoloing my savings on any DD with more than 5 rockets.....anyways PLTR 🚀🚀🚀🚀🚀🚀That’s comedicIt’s the worst lol Take gains and lose em quick.. I started to put my gains from options into shares for at least a couple days so I don’t lose it quick . My account looks a lot more stable lolm1 chips are ARM based which might probably be bought out by Nvidia if China doesn't oppose. Also Nvidia is an AI/data center company now with a decent GPU business, whose GPU's are sold out currently.... so yeah 🚀 🚀 🚀Smells like BROKE BITCH in hereUK will have to Greenlight it tooUK will have to Greenlight it tooI think you’re confusing that for your own scent, retards are potent.", "linkFlairText": "Discussion", "totalAwardsReceived": 0}, {"id": "k25jnt", "stockTicker": "PLTR", "title": "$PLTR", "selfText": "Told you y’all would get burned on the weeklies anyone who said it was gonna keep climbing after that jump you are a dumb dumb.", "score": 0, "comment": "Show your puts then bitchLol, just profit taking.\nWatch the green monster rise up next week. It'll touch 39A bunch of confirmation bias pussies. The chart is literally the exact inverse of all the Green Days on top of bad newsThey are the Waffle House of dataI think I saw nio make the same sort of consolidation after gaining 300% in 2 weeks. RelaxNo stocks only go upRemindMe! One weekTold u bitchI willTold u dumb dumbI don’t see it ? Still says 27Ouch u sure?Lol I saw nio rocket and fall to 1.38 and took months before it even gained any momentum so shut upTold u dumb dumbI will be messaging you in 7 days on [**2020-12-04 18:35:08 UTC**](http://www.wolframalpha.com/input/?i=2020-12-04%2018:35:08%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/k25jnt/pltr/gdsffqs/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fk25jnt%2Fpltr%2Fgdsffqs%2F%5D%0A%0ARemindMe%21%202020-12-04%2018%3A35%3A08%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20k25jnt)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|Told u dumb dumbI agreed with you? I bought puts on FridayAnd think about if you didn’t go full gay bear and would’ve bought NIO at $1.28 or 2/3yr call options.Luckily I don’t have weeklies. Still let’s see where it ends on FridayBallsdeepindidntread my b yo! Glad yo shit printing these retards haven’t been burned before lolEh why? Waste of time to think what if’s", "linkFlairText": "Shitpost", "totalAwardsReceived": 0}, {"id": "kxv13i", "stockTicker": "GME", "title": "$GME - GameStop. Give me more HATE! I’ll be a hero to those locking gains once this thing crashes. The fight is against these players", "selfText": "", "score": 0, "comment": "Holy fuck. This could seriously go nuclear and hit 500+Did someone just got into put position on 13th? Oh their fked lmaoAll I see is boomersBan this guy, keeps posting bear shit every couple minutesBank of America sucks. Let's put it in their butts!Suck my ween Melvin Capital!Lol list of dead bodies.Your margin gonna get called like a whore at a sailors picnic. 🌈 🐻Melvin we know very well. How is boldy doing?GME 🚀🚀🚀 crush the 🩳Who the hell are you?OH NONONO HAHAHAAHAHAHCan someone explain why Melvin haven’t started to cover yet if they expire today?It’s time to sell, not buy... the price doesn’t reflect fundamentals...im all in on GME with my port and margin and i dont understand how. explain yourselfIm the defender of crazy gains. I love it when dumb money steals money form smart money. I’ve been bullish on Gme and the time has come, now This shit will crash soon. That’s why I’m saying lock in the gainzzzzpBecause this is nothing like VW short squeeze. Porsche own had like 90% ownership of shares. There still many players they can get shares from to keep squeezingYes it does, this company did 1.4 billion in revenue last year and its market cap was legit 1b before the run up. This is just a correction for valuation the real run up is the short squeezeYou stupid... boomer fucksuck my fundamental peenThe squeeze hasn’t even started yet, they have to coverHey OP can you link to your image? I want to see details.So you don’t think this is moving higher ?Bruh, I'm pretty sure they did 1.4b during the \\*holiday season\\* alone. \n\nTheir 2020 revenue was almost 6.5b according to marketwatch:\n\n[https://www.marketwatch.com/investing/stock/gme/financials](https://www.marketwatch.com/investing/stock/gme/financials)Bonds > gmehttps://fintel.io/sob/us/gme\n\nClick OPT to arrange the calls and puts together. So you can see which institutions are doing whatI think it had the same squeeze it had on November and it’s gonna dip down really quick. I’m betting on another squeeze when news of earnings of Q1 come out. I really don’t see it go that higher. I learnt my lesson of greediness back in November. I got in at $13 and jumped to $22 and I thought it would’ve gone higher just like it’s happening nowProves my point even more, these people just love to hate when we make gains. Thanks for helping me destroy this manHahaha nice oneSir, this is a casinoTold you to sell. Hope tou listened", "linkFlairText": "News", "totalAwardsReceived": 0}, {"id": "k6y0zu", "stockTicker": "GME", "title": "$GME is a SCREAMING buy. But AFTER earnings…..", "selfText": "Obviously, $GME Q4 results are a day of reckoning for this business. I have long been tracking this company but I only recently got in with some skin in the game (disclosure – I own \\~3000 shares; I am also new to WSB:)). I also think Q3 is an important moment for the company given the institutional dynamics, but **I do NOT think holding through 12/8 would be a good gamble** (which is why you are seeing several people sell their shares to buy in later). Instead, I think there is a better way to play earnings on 12/8.\n\nFirst off, as everyone knows, Q3 results are going to be ugly. Some have made the argument that the market has already priced this in, but this is only partially true. **Market pricing is dictated by both event-driven probability and hype.** I would guess that the probability of GME missing consensus estimates is \\~50/50 (note missing consensus estimates is different from negative growth which is guaranteed in this case). Nobody knows where things will shake out, so the market will price it as such. However, there is a tremendous amount of hype around this stock (for good reason in my humble opinion), which is why I think this stock is trading well heading into an earnings announcement for a turbulent quarter.\n\nNow, **one way to estimate performance is by using credit card activity as a proxy for performance**. We can then use this and compare it to consensus estimates by research analysts:\n\n*Same-Store Sales*\n\n* Telsey: -27.0% (as of 12/2/20)\n* Wedbush: -20.0% (as of 12/4/20)\n\n**If you look at credit card data scrapping services, it looks like the quarter will end down around 25 – 30%** (based on the service you use). Obviously this is close to the Telsey number, but its worth noting that these credit card services slightly overestimated performance in Q2 (so the number will likely be closer to -30%). **Therefore, I have a feeling that this stock is going to sell-off significantly**, **making it a much better entry point versus pre-earnings.**\n\n**Personally, I am still long this stock, but it seems like the stock is going to drop in the immediate aftermath of the earnings release, which is why I will be holding off from buying on Monday. I’m definitely going to scoop up some more after earnings however!**\n\n&#x200B;\n\nHappy to answer any questions :)", "score": 28, "comment": "This guy is trying to get GME gang to sell shares. \n\nWho you working for?If you have the belief that the ultimate direction is up, it may be dangerous to sell and try to get in later. It might cause the loss of potential profits if you sell and have to average up on unexpected good news. \n\nIf you believe that we will go up, then you'll ultimately get there if it plays out that way whether or not you pull out and get back in.I think weak earnings are priced in despite the run up in share price. Shorts have continued to double down and I think anyone still in it is there for the squeeze. \n\nWhat will likely prevent a broad sell off will be positive guidance which is expected and probably not entirely priced in. I think after Cohen’s letter, management is already shitting bricks so expect a very rosy forecast. I’m sure the CEO is already trying to save his job so the way I see it he’s not about to fuck this up.\n\nPositions: 2900 sharesWe're trying to kick start a short squeeze and you're telling us to sell. Fuck off Melvin Capital! I'm buying GME all month until I'm on the fucking moon 🚀 🚀🚀I think that Q3 results will be less important than future outlook, because as you said, everyone knows they suffered huge losses. Been in since 12 though, so it doesn't matter much to me. On the slim chance that there is a major shift in company structure or otherwise, getting in before earnings gets you exposure to any of that. There seems to be more upside than downside to me since they are expected to perform poorly, and any deviation from that, or planning for future events, can cause the stock to rise.You are missing something in your analysis that I need.\n\nYou are telling me that puts would be wise. Okay. That is fine. What you're not telling me is whether IV will fall. If the IV doesn't fall then you are better off simply buying puts and converting them into calls after earnings if you believe that the stock will fall.\n\nHowever I have a feeling that IV will *rise* after earnings substantially making it far worse to get in no matter the value of the entry point. Basically over time you'll be paying, for the same option, twice as much as you would have if you had held through earnings.\n\nThat is my only challenge to your analysis; if you're looking at shares, fine, you're right, but most people are looking for options here.Got $20 calls for april that are up about 100% and shares. Was just going to hold through earnings but now I'm considering selling the calls and holding the shares through. What do you guys think, maybe do that and buy the calls back after or just hold everything? I just feel like theres a chance they could have good guidance or maybe Cohen makes a move with earnings so I don't want to miss anything.I sold dec11 $20 covered calls for like $120/contract and used that money to buy 14/17c spreads for 12/18. Near zero risk imonah. I'm bullish on Q3 because the b&m retail sector in general was able to achieve positive EPS. There's the CARES act to count on too to boost EPS2 words- Ryan CohenNo, the market is forward looking. Even if earnings are rough, they are going to announce how many stocks they bought or a new initiative and the stock will boom!\n\nThey have to nail this or RC is going to dismantle the bird.Going into earnings with shares and iron condors. Ready for anything (including bagholding).I sold 6 $15puts expiring next week. Would love for a dip to get assignedNice analysis. Personally I think it will ride into earnings and sell of either at them or slightly before. Going to pick up a short term 1 day trade, dump and then pick up again after the inevitable fall for the long termIf earnings are bad, won't that just push the short squeeze that much harder?And bad earnings is priced in, no one gives af about sales unless they do better than expected. This is all about guidance and Dogman taking over or not. This ain't your normal earnings retard.I’m agreeing with you on this. I think the dip will get bought up pretty quick before it is too significant though.\n\nI’m too afraid something unexpected will come up and push it up so I’m holding longer calls and selling short term for the premium.[deleted]If one feels this way, sell covered calls and *do not* sell shares.  This is not something you want to time the market on.  You will be wrong and it will be to your detriment.Why not just buy some puts on Monday to protect downside and if it doesn't tank sell the puts on Wednesday?If q3 will be bad Cohen will swing his dick so hard even CEO will ask him to step in and end his sad life. If earnings will be good, stock will rocket harder than NIO when it was actually good meme stockNo way I get out of my position to avoid a bad reaction to earnings. That's how you miss the squeeze. If anything it would just be a good incentive to buy more. Maybe hedge with some cheap weekly puts.I’ll be trimming some of my calls right before earnings to lock in gains but selling shares is not the move at allGme is a garbage company and a dumpster fire.... \n\nThe short interest and possibly of a short squeeze is appealing as well. \n\nBut I will not  buy it until the squeeze starts happening. If it gets over 20 I will start buying and use buy at market orders to help the squeeze. \n\nAfter earnings if it gets over 20 I'm in. But I dont think the numbers are going to be good with pandemic etc.... \n\nIt's a wait and see game...I think you make a reasonable, data driven point about the same store sales. \n\nIf we left out all the incremental initiatives/items (rollout of nascent digital advertising, clarification of the MSFT partnership impact [Melvin is known to have called it a “nothing burger” and don’t buy the lifetime rev share value as being material], any quantification of the blowout November performance & affirmation of market share leading allocations, etc.) then I’d agree.  \n\nNo one fucking knows what’s going to happen, it very well may dip, especially if (when?) the big shorts decide to get aggro and try controlling a negative narrative. \n\nI suspect that any post ER dip gets bought hard.\n\nPositions: 9000 shares, more than 100 $10C from Apr21 to Jan22, and nearly that many deep OTM LEAPSI keep saying this; I don't know why people suddenly think because they are planning to transition to an online store, they're going to go up from earnings. I am not even sure GME is the largest sale of this console generation either. All my local EB games got 4-5 consoles. Walmart, bestbuy and other places here were SELLING the console online release day still lol. EB games online wasn't selling any consoles 6 hours after it was on the website for preorders.\n\nPlus, people seem to forget earnings almost always causes a dip. Even when they post slightly above expectations.1. Timing the market is typically not a good call. \n \n2. Totally not suspicious that a several year old account with one other post (about a sitcom) is telling us all not to buy in.i agree with your assessment about q3 reports....but this has to be all about q4 and the future. what they plan on doing with the increase of holiday lockdowns and how they plan on capitalizing.I'm surprised you didn't mention the squeezeThis CC gonna be more hyped than SBAgreed.  I will happily purchase your GME shares at a fair fire sale price in a private transaction.I like your insight. What are your thoughts on \nBto 16c March expiry or  20c\nStc 18c                               22c\nBto 18p                               22p\nStc 16p all same expiry   20p\n\nUpon finding s/r zones and backed by volume, ma, signals, etc, you sell a put at support and buy a discount call, sell a call at resistance and buy a discount put. sell the wings or sell the meat, I'm still figuring it out. Thoughts?Unusual option buying 12.11 17p bot support thisThis year horrible earnings have caused the price to rise whereas earnings that have beat have caused share price to lower.\n\nLoading upPriced inI was just asking about this on other threads. Too retarded to fully understand options so I’m looking at shares. I have a RH deposit clearing on the 7th, are you suggesting to wait until after earnings report to buy?Shitty earnings are expected and priced in. If they  perform only slightly shitty they may get a pump.What about buying some puts to hedge shares into earnings. Then of it drops you can buy more and avg down and if it goes up u take a small loss and still in the big shares playYou son of a bitch I’m inIf you own shares in this thing. I think the risk of potentially missing a news headline or an earnings surprise is too great. I got burned trying to do what you recommend. I had north of 3k shares and sold 400, 2 hours later Microsoft signed a revenue sharing agreement and GameStop was halted for trading. Then it shot up 50%. I’m holding through at least the March earnings report. Keep in mind also, they are buying 63% of their short term debt early, 3 days after earnings...things can’t be that bad if their cash flow is being used this way.2019Q1,2019Q2, 2019Q3, 2020Q2 CC data under reported sales.... Also have we baked in currency tailwinds from the dollar's vast underperfomance? I think we will be around 1bil in rev but positive EPS. There is your surprise.Ok so what’s to like about this stock. As an outsider looking in, it just looks like an outdated business model with a management team that isn’t making any changes. Please help me understand the hypeTo be frank eb games / GameStop has always been the last place on my mind as a gamer .. hate the store ... hate the people working there . There sales suck .. trade in values suck \n\nPeople buy games digitally right off the damn store on Xbox and PlayStation of steam bypassing these goofs altogether \n\nSelling a game console is at cost for them ... brand new games are profits or cents or a dollar I believe ...\n\nWhy is this place going up ?Illuminati confirmed if they beat their fucking ER when did PS5 start selling?Oh Look, we got a Alpha paperhand over hear. Go dumb ur shares with ur weak ass paperhands. Stupid boiWe see you SUS from Melvin Capital!yea for goodness sake, don’t try to time the market.\n\nno one knows how it will go after earnings. Expectations are already shitty. No one expects anything good from Q3. Even if it does drop, it will recover quickly simply because of the many bull factors.\n\nEarnings is just a small factor. Guidance, new strategic initiatives, developments are equally or even more important.\n\nEdit: If you are really scared, sell covered calls because if price rockets, at least you secure some gains. If it does drop, at least you have some hedge. If you sell your shares, it’s just... unwise. If you are willing to sacrifice a huge potential gain for a tiny loss then you might as well invest in ETFs...\n\nLike OP said, GME is going up in the long run. With a short squeeze, does it matter whether you entered at 14,15,16,17 or even 20s?Haha! Just sharing my personal thoughts/analysis :)Thanks for your thoughts. I agree, long term this is going up. My commentary was just trying to shed some light on my short term perspective.I don't think maybe people have actually [read the letter](https://s.wsj.net/public/resources/documents/RC%20Ventures%20Letter%20to%20GameStop.pdf). This is some HEAT they have to respond to, and it better be good.Interesting perspective - congrats to you for being smart enough to get in on this last year! I agree that for the longer term, Q3 is meaningless, but I do think the market will react to any miss vs. the latest consensus numbers.i though iv falls after earnings report. can you expand on why you think iv will rise instead? thanks man.Thanks for the perspective u/Everyman_B. You raise a good point - I can't comment on option strategy here as that is not my forte. This analysis was targeted at current/future share holders.I wouldn't sell either. April calls won't be affected as much by IV or negative news.  I have a feeling after Earnings IV may increase and those same call may be the same price at a lower share price because of that.A split/hedged risk sounds reasonable.\n\nYou never know what else they might still announce, apart from the un-interesting Q3 results.Nice. Yeah, I’m too in the business of collecting premium, last position - sold $21 12/11 calls for about $110 and bought some cheap-ass puts to hedge against earnings.Thanks for the perspective. To be fair, a lot of the B&M players were able to generate positive comps through COVID which will not be the case here. That being said, the CARES act could be an interesting dynamic.He is certainly a catalyst for this stock!They will have bought zero shares. Stop spreading this misinformation. Management clearly said they aren’t buying back sharesYeah. Either way, it can go only upwards.\n\nActually, the chances of screwing up seem rather low.>, the market is forward looking. Even if earnings are rough, they are going to announce how many stocks they bought or a new initiative and the stock will boom!\n\nI agree with you that the market is forward looking. However, that assumes that they have forward-looking data which we may or may not have (i.e. depends on whether management discloses this information).Best of luck. Definitely important to have big cajones for this play!Interesting strategy. Thanks for sharingAppreciate it! Short term risk hedging could be a good way to play this as well. Best of luck.I don’t think that bad earnings (on its own) would be the catalyst. Perhaps, this would prompt RC Ventures and Cohen to react, but this is a different issue.>selling short term for the premium.\n\nCool - best of luck!Yep - credit card data includes both online and in-store sales. Obviously, the data is imperfect, but it is good proxy given lack of data.I agree selling CCs is wiser than selling shares. However, if you're selling CCs when the squeeze could happen at any time, aren't you essentially trying to time the market that the squeeze won't happen during your CC selling? You'll miss out on gains if the squeeze happens and you have to sell your shares for way cheaperSmart. 20 seems like a good entry and might indicate the beginning of the squeeze. See you there fam!I whole heartedly agree that Q3 numbers are insignificant longer term (which is why I am still long). However, at the end of the day, Wall Street is Wall Street and they care about earnings beats/misses.I think the squeeze has been mentioned enough for one day! That is definitely a plus but it could be weeks / months / years. I definitely can't predict that one haha!Haha glad this was helpful! Per the above, consider getting in AFTER earnings on 12/8. You might be able to get a more attractive price :)Thanks for the comment. I would point you to several of the posts already made on this subreddit in the last week or so (can just google $GME). They have done a great job outlining the bull case here. That being said, you would need to have a much higher risk threshold here to make money given the large swings, so it's definitely not for everyone :)Short squeezeIt is an outdated business model as is. Hype will come from them actively making moves to conform to the current digital age and making improvements. There are a number of catalysts that can basically set off a rapid market buy, thus the hypothetical squeeze people are talking about. They paid off a significant amount of debt recently. There's also the new console cycle with the PS and Xbox. I don't know what GME will be in five years, but I do believe that this is a solid money maker in the very near term.>I play video games a lot and made stupid trade ins as a kid so now I know the fair value of this company\n\nIt's going up because the share price didn't / doesn't maybe reflect the value of the company.Guidance will be good.Sold $18 covered call for this week and sold $20 for next week. Its a good bonus for sharesWhen did the market ever move based on the quarterly report? Its all about the guidance bro. Go back to your mamaYou brought up some excellent points, though if someone were intent on selling out and getting back in I might recommend selling covered calls that net a ton due to the high IV. To hedge against missing out on a possible spike right after earnings, you could buy calls a few strikes above the ones you sold.Sharing your short term view while still holding the shares. GTFO dude, stop being a pussy and walk the talk.IV doesn't always fall after events. It's less an explanation and more of an observation; IV movement can actually increase or decrease at any time, most stocks aren't interesting plays of course which is why the IV falls so hard but for those that are IV can sustain or even grow. GME earnings is *not* the event sought so IV may not react at all.Earnings won't predict short squeeze so the IV might not get cut in half immediately after earnings. Typically earnings + guidance kills uncertainty/IV but does not make up for other black swans like a unpredictable short squeeze. Even if RC doesn't try a takeover or GME doesn't offer a buyback the squeeze might still happen. \n\nRKT had the same level of IV but immediately dropped 80-100% after earnings, you could have sold 2021 $40 calls for $10/contract and bought them back for $1-2/contract two weeks later (even at a sh price of 25-28), I sold shorter dated puts and calls and made decent return, enough to still sell my RKT shs at $21 for a profit. I'm a bit more cautious selling cc's for my GME shs this time but if they get called away I'll take my 30% gains and move on.Got it. Well, then it is a fine analysis for what it is.Rip to your puts, if they were cheap they were otm and iv crush will kill them!And he filed an intent to purchase with the SEC if management doesn’t make the changes he suggested. Its going to be an interesting few weeks.Who knows what they will announce. Buybacks are one possibility, a major game changer is another. Either way, they have to nail it or the great white shark known as RC will eat them for lunch! 🚀🚀🚀😎Porshe wasn't buying Volkswagen. Until they did.Like selling covered calls? I was thinking about doing that with GME before earnings..[deleted]I’m selling 3 covered calls for $22 Dec 11. Someone is paying me $300 in premiums for this.to a degree.  my #1 concern regarding this call....is hearing them say they can’t forecast q4 because of supply constraints from sony and microsoft and nintendo for consoles. from what i tracked this year....every company that did this got spanked.Or you may be buying in at a higher price.  I have been buying every time it dips under $16.  Bought 100 shares today under $17.  MM were holding price down today so $17 calls expired worthless.  I think it would have been at $18 otherwise.\n\nI think GME may be like Nordstrom and pump because the news wasn't as bad as they expect plus debt payoff, plus any 2021/future plans.  They also still have $100M in stock buybacks that was already approved last year that they didn't use.What’s the move long calls short calls or putsThank you. I’ve been trying to look past these posts all week since it isn’t PLTR but I’ll have to do some DD this weekendThank you for the reply, what is the time frame that these catalyst are set to take place? It sounds like everybody is expecting earnings to be shit with good guidance into the future.\nDebt buy back is big, but have they announced anything as to what the plan is to digitalize?The company was closing stores left right and centre and pay stupid rent in dieing malls \n\nYou idiots realize that brand new ps5 is sold at cost for 499 ... these clowns don’t make moneyIs guidance guaranteed? Other b&m retailers are not providing guidance in latest ER. Not sure why it would benefit mgmt to release now, during all this uncertainty.100% priced in.\n\nEdit: what isn’t priced in is the Cohen taking over and their partnership with Sony digital sales on ps4 just wait for that catalystfuck thats good advice. just sold my first cc ever today on GME 20c 12/11. Never thought about buying a call incase it fuckin moons suddenlyInteresting strategy - thank you for sharing.I understand your sentiment but I think he’s genuinely trying to help people find a better entrance price and he raises valid, very real pointsThe ER and following investor call is exactly why IV has spiked. It would take a big announcement to make the IV go even higher afterwards. We're already at 225%+I appreciate that :)Don’t spread misinformationThis might be the dumbest post I have read. This is about a Company buying back their own shares - which they announce ahead of time.\n\nAnother gambler that doesn’t even know the basics of what they are buyingPerhaps, but I am sure there are experts here who know more about hedging. For my part, I will be holding off on buying before earnings completely.better to sell puts in case it spikes on good guidance. calls could lose your sharesAbsolutely. I’ll dig that up and share. It’s worth noting that most of these services are paid services, but I can share screenshots to the extent that is helpful :)Right. And if (not likely, but IF) $GME rockets up to $30 before Dec. 11, then you just missed out on like $2,400 (300 shares x $8/per share appreciation).I also bought 101 shares for $16.81 each today. I can double the number of shares if the price drops a bit after earnings, but it's a guess at this point.I'd expect sometime between Q3 to Q4 earnings. Three month period, maybe. If Cohen doesn't like earnings, he has publicly implied* that he'll initiate a takeover, so that could be a catalyst. I'm sure anything they announce will be on Dec 8th. Anything can happen, so it's just sitting and waitingIf they don’t provide guidance, shareholders will eat them alive. Especially after the whole Cohen ordeal.Yeah... you'll have to hope we don't gap up on Monday if you're wanting a call to protect your upside, or hope that we don't moon in general until you're out from under the $20c. Don't fomo, that's how people lose money. Theta gang is always a good play, though on a stock with moon potential like this you may want to modify your plays. \n\nSomething I did on RIOT was own ITM calls and sell call credit spreads, essentially making them covered call credit spreads. You're losing some premium compared to just the covered call, but you miss a minimal amount if we moon.No problem, feel free to ask questions.IV for GME has been this high for months. No one could possibly care about the earnings. To even say that is to not understand the GME situation. The short-squeeze definitely is not something regarding the earnings of GME.It's screaming... short me!Sorry I heard that on hereBut isn't the point to protect my position if it doesn't spike. How does selling puts do that?Yes. That’s is the risk.  But your implying the stock might double in a week.Thank you, I’ll do some DD this weekend!He never said anything of the sort. It is only implied in his letter.The investor call is where we expect the board to have to respond to RC since he sent it during the quiet period.No, that's just you after every GME commentI'm genuinely curious not being argumentative. I just started messing with covered calls and I dont think I grasp covered puts as clearly yet.. Reading up on it.It doesn't protect your existent position at all, I think he's trying to present it as an alternative to a buy-write.Still won't matter. Console cycle is where the money is. Cohen is ... well if Cohen didn't exist console cycle is where the money is anyway. Cohen is a weird variable.Short me!Selling a put when IV is high means you will collect the premium and possibly pick up more shares at a lower price. The premium you get when you sell it is your protection. And if it doesn't drop, you keep it anyway.Gotcha thanks for clearing that up. If I can ask one more question. So when you write a covered call you want it to match your shares. So 500 shares would mean 5 covered calls. Is it the same with selling puts or is the short position I'm opening independent of those shares?No, puts are secured with cash so if you sell a 15p you'd have $1500 used as collateral until the position is closed or you get assigned.Ah ok. Thanks again.", "linkFlairText": "Discussion", "totalAwardsReceived": 1}, {"id": "k5lh84", "stockTicker": "YY", "title": "$YY = TikTok + OnlyFans", "selfText": "Greetings fellow autists. Y'all remember Marie Kondo? Japanese woman that gets off to cleaning people's shit up for them? Only keep things that spark joy? Fuck yeah. Well, with all you retards losing money by being balls long PLTR, I figured it was time to help you Marie Kondo your own portfolio. Let's tidy that shit up and spark some fucking Joyy.\n\nYes I spelled Joyy with two y's. And no big brain, that wasn't a typo. **Joyy ($YY) is your next one-way ticket to the goddamn moon.** Can you do basic math? Great. Neither can I. Do you get slightly aroused at the mere sight of a woman with a pulse? Of course you do. I myself just went six to midnight typing that out. Do you like losing money in the stonk market? Clearly. But I'm here to try to change that.\n\nCongrats on making it this far. Let's get started!\n\n$YY is the largest live-streaming platform you've never heard of. **It's like if TikTok merged with OnlyFans and was a publicly traded stonk**. I'll wait while you buy a few shares on that premise alone.\n\nBut it gets better. Much better. Joyy operates two live-streaming services, one is called YY Live and its getting sold to Baidu for $3.6bn. **The other is called Bigo Live and it's one of the top 10 apps in the world with revenues growing more than 130% y/y.** Many of the videos on Bigo are of hot Asian women live-streaming themselves dancing. Nice.\n\nThat's still not even the best part though. Galaxy brain question: would you rather pay full price for something or get something at a discount? What if you could get it for close to free? Well, at YY's current price, you're nearly getting Bigo Live for free. Please consult a doctor if you have an erection lasting for more than four hours.\n\nHow can that be? This part requires some remedial math skills that you and I both don't have, but alas, we must soldier on.\n\nYY currently has $2.8bn in net cash on their balance sheet. Woah! I didn't know this was a fucking advanced accounting class. Well it is. Stay with me. We also know YY is going to get $3.6bn in cash from Baidu for the sale of YY Live. Lastly, YY is an investor in a company called HUYA that is valued at $750mm.\n\nSo... $2.8bn plus $3.6bn plus $750mm is? No, not $420.69 you retard. Try again. It's $7.1bn. Feel free to sit down and drink a sip of water if your head is spinning from all these numbers.\n\nCompare this $7.1bn to YY's current market cap of $7.8bn. $7.8bn minus $7.1bn for everything that isn't Bigo Live is $600mm. There you have it. That's the implied value the market is giving to Bigo Live.\n\nHoly shit right? To quote the great David Byrne from Talking Heads: [you may ask yourself](https://youtu.be/5IsSpAOD6K8?t=69)...\n\n* Didn't Baidu just pay $3.6bn for YY Live?\n* And isn't Bigo Live growing 130%+ while YY Live is barely growing?\n* And aren't Bigo Live and YY Live about the same size at $1.8bn in revenues?\n* And finally – you may ask yourself – if Baidu is willing to pay $3.6bn for YY Live, shouldn't Bigo Live be valued way the fuck more than that?\n\n**The answer to all of these questions is fuck yes.** Bigo Live should be valued way higher than $600mm but you retards are too busy jacking off and losing money on PLTR to figure it out.\n\n**The other great part about YY is we get to fuck some bears on our way to the moon**. I cannot expressly condone nor condemn the actual fucking of bears, but I can condone the fucking of some short sellers. Muddy Waters just released a short report on Joyy and short sellers piled in like the dumbass lemmings they are. How did YY respond to the short report you may ask? **By giving MW the double middle finger and increasing their dividend by $200mm.** Do frauds usually do that? Hell no they don't.\n\nThat's how you fucking spark Joyy in your portfolio!", "score": 2, "comment": "Isn't this the company generating fake #s with bots? Cool man, cool.One one hand: too long to read, first impulse is to YOLO.\n\nOn the other hand: If I wanted to pay $80/shr for a Chinese government-controlled porn service, I'd jerk off onto a hundo, take a picture, and digitize my dong.\n\nI'm autistic, not STUPID.Dividend increase in context equates to about 1 cent per share. Not very impressive. Add this to the fact that they basically had no response to the bot allegations and the China delisting coming up. There are plenty of better places to put your money, don't put it here.At least link the report. [$YY = Fraud](https://www.muddywatersresearch.com/research/yy/1/)Their numbers r fake.The puts I bought after the MW report say fuck you. Well, they would be anyway if I hadn't sold them for a 70% loss. But really, fuck you. December 02, 2020 11:00 AM Eastern Standard Time\n\nNEW YORK--(BUSINESS WIRE)--Bronstein, Gewirtz & Grossman, LLC notifies investors that a class action lawsuit has been filed against JOYY Inc. (\"JOYY\" or the \"Company\") (NASDAQ: YY) and certain of its officers, on behalf of shareholders who purchased or otherwise acquired JOYY securities between April 28, 2016 and November 18, 2020, both dates inclusive (the \"Class Period\"). Such investors are encouraged to join this case by visiting the firm’s site: www.bgandg.com/yy.\n\nThis class action seeks to recover damages against Defendants for alleged violations of the federal securities laws under the Securities Exchange Act of 1934.\n\nThe Complaint alleges that throughout the Class Period, Defendants made false and/or misleading statements and/or failed to disclose that: (1) JOYY dramatically overstated its revenues from live streaming sources;You had me at GreI heard YY is XXX approved!IunnoNot enough hype! Sticking with TSLA and GRWG.KonMari my Account daddyPuts it is!! Once it's time to be audited YY wont be around in the USWhen Muddy Waters shorts a China stock, I stay far far away. His DD on China frauds is phenomenal. It'll be interesting to see what happens to YY tomorrow. There's a theory that a delisting risk would hammer those stock the most that couldn't possibly stand up to US audit scrutiny.Even if I could read its too long to read, i ll pass.that feeling when you're in a deep rabbit hole and end up watching some weird shit on youtube.Ban this shillYY 40p leap here. Thx for your service.I’m soldYup:  \n  \nhttps://twitter.com/muddywatersre/status/1329138547228438530LMAO!  OP tried to get people to short TeleDoc 3 years ago when it was at $21 a share.Seen another post about YY a few minutes ago. Probably some pump and dump attemptYY will not have any direct exposure to China after the YY Live deal closes. They're headquartered in Singapore. Plus, why just take a picture of your dong after jerk off onto a hundo when you could livestream the whole thing?YY is headquartered in Singapore and their only direct exposure to China is through YY Live. After the sale to Baidu closes, they'll no longer have any direct exposure to Chinese regulations or risk from the potential delisting of Chinese stocks.Those lawsuits don't mean anything. I remember when hundreds of these lawsuits were coming after NIO back when their stock was in freefall mode. Just a bunch of salty boomers/karens that can't accept responsibility for choosing a shitty stock. Its quite pathetic actually since you never see any of us filing a lawsuit for our terrible decision making.Thought so. Thanks for confirming.We will have to see. I personally am bearish and believe the allegations. If the sale to Baidu completes AND the company is cleared of fraud, that would be the time to buy in.\n\nRight now YY is like Nikola with extreme up/down potential depending on how the fraud case plays out, and whether their partnership continues.Like Nikola is perhaps the most retarded comparison I've heard in at least an hour...good job.Exactly. Fraud confirmed, stock kaput. In China everything is basically Luckin Coffee anyways.", "linkFlairText": "DD", "totalAwardsReceived": 0}, {"id": "ihrohm", "stockTicker": "TSLA", "title": "$TSLA to 125.58 by January 7th", "selfText": "Nikola Tesla died on January 7th, 1943. DJIA was at 125.58 on January 1st, 1943. Not adjusted for inflation, of course, because $JPOW just did an inflation speech a couple hours ago, which was from Jackson HOLE.\n\nBasically, it's a given that $TSLA is going to die hard on January 7th 2021, given this is the anniversary of their namesakes death. Didn't happen last year? Wow, cool. 2021 - 1943 = 78. Biden will be 78 in November. That's why it didn't happen last year. Idiot.\n\nPositions: $TSLA 125.58p 01/07/2020\n\nThis option will be available from the MM's in like two days after SPY breaks through its $350 resistance.", "score": 0, "comment": "Shovel this bear-shit back up your ass where it came from, aint nobody got time for this faggotry.Literally discriminating papa elon, gtfo newfagGodspeed, moron!What stage is grief is this?Tesla 2k January 7th after split? Got it!Praise L Ron HubbardThe only thing he said that was right was SPY breaking $350 in a few days. The rest was 🌈 🐻 shitbears r fuk", "linkFlairText": "Shitpost", "totalAwardsReceived": 0}, {"id": "f4vbcj", "stockTicker": "DXCM", "title": "$DXCM is about to 🚀 to the 🌙", "selfText": "DXCM is a medical device supply company that just CRUSHED earnings and is expected to grow revenue 21% over the next 12 months. Other things to keep in mind:\n• Recently pases the “golden cross” indicator, signifying a long-term bull run.\n• After earnings, updated price targets rose 18% overall \n• Growing much faster than the overall medical device market \n• Statutory EPS was 48% over what analysts expected for this past quarter\n\nThis is all 🚀 fuel and $DXCM is about to soar. I really think this is a great opportunity for mid-term calls to make lots of tendies.", "score": 0, "comment": "\"golden cross indicator\"\n\nShut the fuck up.Screenshot Position or ban. DXCM pumpers need to go back to r/all.Pumper. Gay.#PositionsOrBanThis was just posted yesterday. What are you evenWe already got spce to get us to the moon, we good.You're a day late for the forum, and 2 years late for non-retardsmarket cap seems high for such a narrow product line. Fuck it I’m inYou’re about a year too late.PrICED INup 18% in one week... up 20% in a month.... gonna wait for that pullback babyThis post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*I don’t think people still have diabetes. Sounds like fake news. Sounds like you are holding the bag and are looking to unload.DXCM has been a good stock to option on for a while.  Been good to me. Ima wait until next week to get involved in to see where the earnings direction settle in at then take my bull trade.Remindme! 3 hoursDebatableThis post didn’t age well. Both SPCE and DXCM tanked after this post.Legit about to happen again as earnings are scheduled for 4/28 🙏🏼I’ve put it on my watchlistSounds like a stratton oakmont pitch😂The best pumps in the rump.He’s gay.Is he actually?We will need medical providers when we get there, right?SPCE is going to pop this weekHow dudeI will be messaging you in 3 hours on [**2020-02-18 01:18:48 UTC**](http://www.wolframalpha.com/input/?i=2020-02-18%2001:18:48%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/f4vbcj/dxcm_is_about_to_to_the/fhykquk/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Ff4vbcj%2Fdxcm_is_about_to_to_the%2Ffhykquk%2F%5D%0A%0ARemindMe%21%202020-02-18%2001%3A18%3A48%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20f4vbcj)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|I really think it’s got a lot of room to run in the short to mid termWe’re going to have to leave stragglers like you on earth when we go to Mars. Musk and Branson or bust my guyI’ll see if there’s a pullback it’s a bullish chart. I like bullish charts.Enjoy the tendiesBullshit charts?", "linkFlairText": "DD", "totalAwardsReceived": 0}, {"id": "kjqswh", "stockTicker": "BABA", "title": "$BABA lawsuit is not political", "selfText": "American neckbeards assume that this is politically motivated but it's not.\n\nAll Chinese tech companies have been engaged in anticompetitive practices for twenty years.\n\nAs an example, you cannot link to Taobao from WeChat because Tencent blocks it. And vice versa. \n\nThis is an open and shut case. \n\nSimilarly, the blocked ANT IPO was reasonable because they were creating a Chinese version of the 2008 financial crisis with their overleveraged loan business. \n\nGot fucked on futures, still holding the stock and buying more in January.", "score": 0, "comment": "How long have you lived in China?\n\nIf you think there's a single thing about the Chinese economy which is NOT politically motivated, you have a surprise coming.The fact that all Chinese tech companies have been engaged in anti-competitive behavior for 20 years and it is only now, that BABA, after Ma spoke out, is being investigated, shows that it is politically motivated.\n\nIf it weren’t politically motivated then the CCP would have just been cracking down on all companies over the past 20 years.Nothing in china at this scale is apolitical, you're kidding yourself.I hope u r right. \n\nI went balls deep $baba dec31 215c today. Up 25% already.CCP shill alertI fked up and didn't have the chart open all day to get the real dip price. 1500 shares at 220. I'll take my chances.Are you kidding? Political is the only reasonFutures? Hangseng or..?You never mess with the Supreme Leader, periodYou've only ever posted about BABATen years. You?Ant was pretending to be a tech company while they are actually a financial company brokering or creating loans.\n\nThey would have been cracked down on eventually. The speech brought attention to Ant yes but the same would have happened eventually either way.How do you feel about the February 2021 calls (2 months away) at strike 220Autism is a helluva drugWtf that is some fuck you money10 years in country and you are still clueless about how shit works.\n\nSounds about rightAnt group actually sell most of the loan to banks, they are the middle man between banks and the loaner.An ENTIRE ethnic group is being systematically genocided right now because some dumbass uyghur tried to blow up Xi the Pooh. \n\nThis is what we are dealing with. That level of vindictiveness - Jack Ma embarrassed them. Baba as it is now is toast.I like them too and will roll my calls due this week into longer dated ones prolly Wednesday. \n\nI was just trying to get the most leverage i could for the (hopefully) bottom last week. \n\nIts such a tough call on this whole china thing. It could he mucho ado about nothing for baba in which case we are back to 300$ in a few months or it could be much more sinister than that in which case we dont know where shares will be. \n\nBut thats what makes for a volatile market so we will take it. \n\nGood luck.Keeps things interestingThe fact that there are so many ignorant American retards like you shorting BABA is precisely why I'm longI think Im going to go with the April calls.  That should be enough time for it to recover back over 300.  I hope it dives down real nasty in the morning so that i can buy the calls cheap, hope it dips under $200 that would be ideal", "linkFlairText": "DD", "totalAwardsReceived": 0}, {"id": "gkd7s4", "stockTicker": "MARK", "title": "$MARK - Walmart, Disney, other big names are partnering with this AI Based Thermal Imaging company", "selfText": "Remark Holdings Inc (NASDAQ: MARK) is flying in the market today, and it’s nothing new. For several trading sessions, the stock has traded on either single, or double-digit gains.\nThe gains started when the company announced that it started shipping AI based thermal imaging technology to customers in the United States and Japan about two weeks ago. Recent evidence shows that one of these customers may be Walmart Inc (NYSE: WMT), but there’s much more to this than Walmart. [article](https://alphastocknews.com/remark-holdings-mark-stock-theres-more-to-it-than-walmart/3352/)\n\nDD done by “Informed Observer”\n\nMARK remains in default on $11.9MM of debt owed to MGG which delivered its notice of acceleration to the Company on March 16. The 30 day period to cure the default ends tomorrow. MARK is likely able to meet this obligation under the terms of its $30MM Common Stock Purchase Agreement with Aspire Capital Fund (signed April 9, 2020); however, it comes at the cost of additional dilution for shareholders, particularly in the context of MARK’s intrinsic value.\n\nMARK is also in the process of resolving the risk that it is delisted from the NASDAQ for failure to maintain a $1.00 per share valuation for a ninety day period. The requirement for curing the notice of delisting is for MARK’s shares to close above $1.00 per share for 10 consecutive trading days, before, by my estimate, the 22nd of May.\n\nThe resolution of these two controversies remove two important catalysts which have been central to the short seller thesis and is likely to contribute to short covering.\n\nThe Company still has to finish its 2019 audit and it is unclear to me; Covid notwithstanding, why this has taken so long since the sale of the Company’s Vegas.com was completed in May 2019. The good news is that MARK’s auditor has not resigned and the Company’s past audits have been qualified with “going concern” risk language, so at this point the auditor’s opinion letter can’t get much worse….unless they refuse to provide an opinion…which should already have been announced if it was going to happen.\n\nAs we get closer to MARK’s restated Q4 and FY 2019 10-K filing and update call on Thursday, May 28….market focus will shift to the contents and substance of the Company’s narrative regarding the status of its KanKan AI business with particular emphasis on names of clients and the size of contacts and the implications for twelve month revenues and cash flow. There has been a lot of speculation on these issues in the past three weeks, much of it informed by the Company’s own tweets, which is a business practice that many appropriately believe hurts the organization’s credibility.\n\nMARK management needs to be clear and precise on their call on the 28th about the status, size, and duration of contracts (even if NDAs prevent them from naming clients) and provide investors with 12 month revenue and margin guidance, Open-ended statements about the scope of the thermal imaging and AI opportunity (as they have done on past calls when talking about the China business) without reference to real contracts is insufficient given the Company’s Twitter teases about Wynn, Simon Property Group, (Disney or was there a different source?) et al. The call needs to expand upon, not regurgitate, the substance of the Company’s rare and effective official statement of April 30.\n\nIt is hard to know the number of outstanding MARK shares at the moment but reasonable to assume that it is markedly higher than the 55.1MM last reported on September 30, 2019. Nevertheless, the value of MARK’s investment in ShareCare (which remains impaired by MarK’s default on the MGG loan) has appreciated by more (based on the revaluation of the telehealth sector which is up 60-80% with the outbreak of Covid-19) than the increase in MARK’s share count (which has a share cap of 20% under the Aspire Agreement).\n\nThe value of the ShareCare investment (once unencumbered by MGG’s lien) likely supports a MARK share price that is 2-3X MARK’s current share price. The value on the KanKan AI business and any contracts that the Company has secured in the last six months (or will secure in the next six months) is all incremental to the value of MARK. Uncertainties remain over the next several days; however, their resolution and the fact that MARK will own the narrative thereafter (and may actually announce contracts), creates an attractive set-up and demands attention.", "score": 0, "comment": "Penny stocks are very dangerous do not listen to this bullshitThis stock is being shilled on stocktwits very hard. Trade at your own risk.350% IV, the lowest option strike available is $2.50 with a breakeven of $2.85, meaning you need a >90% increase in stock price to get in the money by july 19.\n\nThis is a stupid pump n dump.https://www.investopedia.com/articles/active-trading/083115/4-signs-penny-stock-worth-millions.asp\n\nJust because it’s a penny stock, doesn’t mean it doesn’t have the potential to grow in valuation to fill a niche. Ford, Inovio, and SiriusXM were all once pennies. Pennies are volatile, and if you know little to no risk management and do little to no real DD, you’ll always be going with the majority consensus which is brain dead and unsustainable if you’re not looking to just get lucky in order to win. That mindset is going to lose you money trading at any level if you don’t weigh in your own opinion, backed by solid research.\n\nThere is obviously a lot more work that needs to be done with MARK, and their PR team desperately needs a revamp, but there is a very large divide between those who believe this tech is going to find its footing and it’s place in the upcoming months as a needed concept, and those who are trying to short it. I’ve made huge profit on the recent pump & dump but there was no doubt in my mind to buy back in. Take what you will from your research, at the end of the day it’s your money. But very nicely done on doing the legwork to actually know what you’re actually buying besides the ticker and the stress.\n\nNow go lose 30% of your portfolio on those SPY puts, you crusty barnaclesGood writeup. \n\nbeen looking into them (but I rarely mess with pennies)I been holding this bag...Sir, this is the bread line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*Penny stock that does AI and other buzzwords? Hmmmm what could possibly go wrongI read what you wrote above, but I have trouble investing or gambling on any person or business that can’t even pay it’s rent!\n\nFrom page 19 of Remark Holdings Annual report they finally released yesterday: \n\nLandlord Litigation\nOn April 9, 2020, our former landlord, BRE/HC Las Vegas Property Holdings, L.L.C., filed a Complaint against us in the District Court for Clark County, Nevada alleging that we breached the office lease we entered into with the plaintiff for our former office located at 3960 Howard Hughes Parkway by failing to pay rent and other required charges under such lease. The plaintiff is seeking monetary damages in the amount of past due rent and other charges, plus attorneys’ fees and costs and interest and certain declaratory relief. We are currently in the process of negotiating a settlement with the plaintiff to resolve this matter.\n\n\nPage F-3 towards the end showed Remark Holdings had $272,000 in the bank by the end of the year. I would like to tell you how much cash they have now, but they still have not filed their first 10q for 2020.\n\n\nfrom page 18:\n\nGreenspun Litigation\nOn May 21, 2019, James B. Gibson, in his capacity as the designated representative of the Amy Greenspun Arenson 2010 Legacy Trust, James Adam Greenspun 2010 Legacy Trust, Moira Greenspun Tarmy 2010 Legacy Trust, Jeffrey Aaron Fine 2010 Legacy Trust, Alyson Fine Marmur 2010 Legacy Trust, Jonathan M. Fine 2010 Legacy Trust, Kathryn A. Fine 2010 Legacy Trust, DRG Holdings, LP, DRG Legacy Limited Partnership, LLP and GC Investments, LLC, filed a Complaint against us in the District Court for Clark County, Nevada alleging that we breached the purchase agreement we entered into in connection with our acquisition of Vegas.com from the plaintiffs in 2015 by failing to make the final earnout payment under such purchase agreement. On July 12, 2019, the Nevada court entered a judgment against us in the total amount of $1,050,000. We are currently in the process of negotiating a settlement with the plaintiffs to resolve this matter.\n\nHow are they going to pay what the judge said they have to pay!?!Yesssssss.\nThe company's thermal temperature checking kiosks and helmets are being shipped now.\n\nThey are also equipped with advanced levels of AI for facial detection, etc.,This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*Wow what a story markYea.... horrible ideaCan anyone tell if the UI at 31sec in this shanghai park reopening is KanKan? https://www.nytimes.com/video/us/100000007046988/nursing-home-coronavirus.html?playlistId=video/coronavirus-news-update\n\nFont looks the same\n https://www.youtube.com/watch?v=UTOmBi1-QwoHow’s it feeling after the last 12 days growth?Do you at least see potential in the concept ?This didn’t age well.Currently trading at 3.50 and still going up!!!!What is the math on this calc?buy shares you ape.What do you thinks going to happen now? 2.20 seems like a good entry to get out around 2.70-3 and then do it again pApparently nothingStock went rocket my friend.No it’s a penny stock your gonna get scammedhope you sold today. dump is incoming.and dumping now 30% down in past day and a half.  \n\nThis is why it's called a pump n dump.just the break even price/divided by the current stock price.  you basically need the stock price to double to get iTM“The Concept” - AI thermal imagining\n\nDo you believe this form of safety measures will become more of a demand as we approach post covid life?Again, didn’t age well.no cause the WHO has said they don't work. Its a form of security theatre. Business want them so they can make people feel safe but if government agencies aren't going to mandate them the demand of the thermal imaging technology is not going to substantially increase. Thermal Imaging does little to prevent COVID due to 80% of all people being asymptomatic of those who get infected.Still didn’t age well hahayou sure about that lol?You’re questioning if this will prevent the virus, a vaccine of some sort. That’s not the purpose of thermal imaging or this company. A high percentage of Covid cases have fever like symptoms. I did not say all, but a high percentage. These thermal imaging devices can detect the body temperature within .3 percent. Facts matter, so I’ll have to edit this comment with the links I read yesterday. So if big stores can preach safety to the public by being able to detect high body temperature before entering their stores, I’m assuming that is a step towards preventing spread. That alone is something the general mass would love to hear and seems worthwhile.I think it aged perfectly actually considering the stock is down 30% in the past 2 trading days.bruh they dont work\n\n [https://www.fastcompany.com/90503493/thermal-cameras-are-terrible-at-exposing-covid-19-companies-are-buying-them-anyway](https://www.fastcompany.com/90503493/thermal-cameras-are-terrible-at-exposing-covid-19-companies-are-buying-them-anyway)I mean yeah now it did haha I wish I sold at 3.70 I pulled  $5000 1.99 out at 2.55 and am stuck with 150 at 2.89... may pull out again then ride it around to see what happens this stock will still grow\n\n!remindme in 1 monthFrom the article you just shared:\n\n\nStill, he says, pandemics have been spurring sales of thermal tech since 2003, when SARS emerged. FLIR has seen sales spikes during MERS, H1N1, and Ebola outbreaks. Typically, these taper off over time, but Bainter thinks that COVID-19 has incited a new behavior in the commercial market. “Frontline screening will become the new normal,” he says. \n\n\nWhat point are you trying to make again?There is a 1 hour delay fetching comments.\n\nI will be messaging you in 1 month on [**2020-06-29 19:29:46 UTC**](http://www.wolframalpha.com/input/?i=2020-06-29%2019:29:46%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/gkd7s4/mark_walmart_disney_other_big_names_are/fs8db2p/?context=3)\n\n[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fgkd7s4%2Fmark_walmart_disney_other_big_names_are%2Ffs8db2p%2F%5D%0A%0ARemindMe%21%202020-06-29%2019%3A29%3A46%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20gkd7s4)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|That your a horrible person scamming first time investors into investing in a penny stock with technology that won’t have any government backing in the near futureLol I created a Robinhood account two months ago bro, no one is trying to scam anyone. This is my money too. But please, go on.Lol I love losers who don't know the market. That \"useless\" penny stock is now worth $2.90 and worling on climbing even higher tomorrow morning. This is what we like to call a short. He wants to short people so the stock tanks and he can buy at a super low price.I sold half my shares at 2.05, but I’m sitting tight at 1.56 avg!Look out for tomorrow. Tomorrow we could see the make or break of $MARK. And the Earnings Report is happening on Thursday.Also I don't know if you have found it but there's an app/website called stocktwits that is helpful in seeing what people are saying during the day about stocksThanks ! 🤜🤛Yesssiiiir. I'm holding until Tomorrow morning. If it dips im out. And enjoying my profits.If it dips tomorrow, why would you be out? How much of a dip did you have in mind when making that comment? What I’m really asking is if it dips, you don’t believe it will go back up as areas open after covid19? \n\nCurrently holding! Not sure how long but it’s the only penny stock I have. Thought I’d give it a try lolMy plan was to sell before the dip and buy more lmao.", "linkFlairText": "DD", "totalAwardsReceived": 0}, {"id": "cvxiue", "stockTicker": "SNAP", "title": "$SNAP and other app-based companies are billion-dollar commodities and are FUCKED during the next market crash.", "selfText": "And I think that not enough people are paying attention to the work that Alphabet and Amazon are doing in the digital space. \n\nI'd bet most of you retards have no idea how any of the shit you use actually works. Especially options. But ignoring options for a little bit, I wanna focus on web development.\n\nThere are two kinds of autists; you guys, and the kind [who can actually make money.](https://www.bloomberg.com/news/articles/2019-08-21/goldman-plans-hiring-spree-in-trading-only-coders-need-apply) A lot of the folks in that second camp have been spending the last 10+ years making web development easy and accessible so even retards like you and I can #LearnToCode. Doing this is important for a bunch of reasons - for example, if the internet of things is going to become a reality, it can't take years of development and a team of researchers for a company to build a connected toothbrush. \n\nIn other words, apps are going to become almost like commodities - in the sense that they will be cheap, fungible, and easily produced. And there won't be any shortage of people capable of doing that production - especially when you factor in educated workers from emerging markets. \n\nI think Alphabet has stayed ahead of the curve by positioning itself at the center of a lot of the otherwise open-source dev projects, whereas Amazon has it AWS. Companies like Snapchat and Uber, on the other hand, are billion-dollar commodities.", "score": 4, "comment": "Look at you thinking you’re a smart cookie. Everyone knows the value of these apps is the network effect not the software itself. If all it took to build the next facebook was coding it a lot more people would be trying.Op doesn’t realize that the software piece is the easiest, getting the users is always the hardest.Great, so all you need to do is accurately predict when the next market crash will be.\n\nGo ahead.K boys let’s clone a fake Uber repo and instantly make billions!Uber is lame afThe money is in the platform, not the app itself dipshitIt’s all about the advertising dollars and having warm bodies viewing them. \n\nI saw a Trump 2020 ad on Snapchat last week, the 2020 election is going to be huge for social media platforms as political campaigns pour money to capture  new Gen Z voters.You zip it sparky, SPY or die, the rest are just icing on the cakeMy uber position is getting rekktAs a mid-level developer, I can tell you that the dropout rate for developers is massive. Even those that finish school or training programs are still in an uphill battle because nobody wants to hire a novice developer, that's more work than not hiring one at all. This causes many more new developers to get dropped off during the job search phase.\n\nDevelopers aren't in high demand due to a lack of people trying, it's due to a lack of talent because the early learning curve is steep and landing a job is rough.\n\nSoftware also has to be maintained and updated. It will never become worthless or \"cheap commodities\". The only exception are simple mobile games that get spit out like no other and never get touched again.Google will be fucked eventuallyI remember when Google tried to make Google+ the new Facebook. I'm pretty sure they relaunched that a few times too.I like you, you are all right with me SpermInvestor.(Serious tho)Exactly what I was thinking. The sw itself is largely a commodity (yes there are innovations in UI and UX) but the platform, reach and network effect is  why those mentioned companies are worth billions. Facebook and other consumer products would be worthless if there were no usersAnd MySpace was very popular ... right up until the point it wasn't. And how much did Tumblr recently sell for? I'm sure it still has a pretty big userbase. And if it doesn't, that still works in my favor. And how does the network effect apply to Uber?\n\nI'm not smart, I'm just not as much as a retard as you are - which is really my point here. That DURING A CRASH - i.e. when everything is going down - you wouldn't want to be the guy holding a company like Uber.I get that - but stocks are meant to be 10+ year investments. Putting your money in something easily replaceable/upgradable for 10 years is risky.\n\nWhen people are looking for overly risky assets to dump (i.e. in a panic during a crash) I just think Uber and Snap will and should be high up on the listSent from UberPoolwhat else is there if i wanna go somewhere from my house, a fkin cab service that comes 40 min later??Honestly I think now's a good time to buy SNAP. Tripled in value recently, and there's still a lot of room to grow. If next years earnings are positive (which they should be) because the platform is growing. Yeah Snapchat has a growing userbase, mainly due to its popularity with people 11 > 21. Snapchat is worth roughly $15.9 a share. I think that could increase to $25 > $35 within two years, if the predicted recession doesn't happen in that time.\n\nAlso, even if a recession DOES HIT. Snapchat is a free service. Unless 20 million people suddenly decide they can't afford a cheap android smartphone, even if they can't afford a new IPhone, Snapchat won't be hit as hard as other companies, that provide luxury services. I'd probably buy even more SNAP stock if a recession hit. Double your profits when the world comes out the other side.Soxl/FNGU or die*\n\nYolo like a manHowIt’s a network effect because more clients attract more drivers, attract more clients,etc. The larger the user/driver base the better the value proposal for everyone on the platform hence a network effect.\n\nPretty sure I’m wasting my time explaining this to you though because your clearly a 15 years old trying to act like he knows shit.\n\nThe case agaisnt uber in a recession is clearly more the fact that it could be deemed a luxury good which would be the first expense people would cut in a recession. Not that the software is easily replicable.Why amazon?  AWS hosts some of the largest company’s data and compute in the world.\n\nI just think you should be aware that in the olden days (90s) if your company could build it, it would be a success — mostly because people had good ideas but no one was sure if it was possible to actually build the hardware.  Now that most things are software they can almost always be built, but the question now is if anyone will want to buy or use it.  \n\nApps are already fairly easy to build, spend a couple grand to a few million and you can hire teams to do it fairly reliably.FDs don't last 10 years.     \n     \nYou're doing it wrong, bb.Yes, that’s the drawback and largest risk of consumer companies, missing the trend ie AOL, Yahoo, MySpace. Continuous innovation to remain relevant and to meet consumer needs.$SBUX to 200 by 2021, now what?EU ~~shakedowns~~ fines?  ¯\\\\\\_(ツ)_/¯Network effect fails as it becomes a commodity. Currently, there's Uber and Lyft, and all their drivers drive for both. Soon, there will be a few dozen others, and we'll have TSLA and Waymo cars driving us around. As more drivers drive for more and more tech companies making riding apps, the less Uber and Lyft make. When anyone gets self driving to work, there will be as many cars as that company and it's VC backing can afford. Then we'll have the scooter situation... My metro started with one scooter and one bike company; now there are seven companies renting scooters and five renting bikes. Our streets are littered with them. And I really those bitches off every curb I see. It's awesome.Ah the good old days.85% of their revenues comes from ads. Banner ads are already getting destroyed by Adblock browsers like brave. \n\nI see the web moving towards privacy by default in the future. Which leaves their ad revenue model in troubleI think its a bit more nuanced. Uber and Lyft are the main two, Juno is kinda in NYC but not really. If you wanted to start another driver network it would fail b/c 1 the space is full and 2 the model isn't profitable with human drivers. In the begging you can cobble together an app and enter the market but I don't think this is the main stopping point for ppl with millions to invest in a company.Ad blockers don't exist on mobile, and the vast majority of web browsing is moving to mobile. Also, in a more privacy-focused future, their ads would be less targeted, not less prevalent.     \n     \nLook at stats on ad blockers to see how dumb you are, ya pathetic downvoter. Lol.That's fair. But, others will follow Juno in select areas, and there are (supposedly) driverless options coming.   \n     \nE: it'd also make sense for F and GM and other auto manufacturers to get in on this game. I could see discounted cars for their exclusive drivers or something. Idk.Ad blockers don’t exist on mobile?Ad blockers do exist on mobile browsers... I use one nowyou are right googles ads would be less targeted. Which means less effective as an advertisement tool. If users flock to a privacy by default browsers like brave they can grow out their own ad system they are developing now. Googles ads have become spywareish with trackers/malware whereas braves aim to show you targeted ads but it lets the browser decide on the targeting without spilling your data over the network to publishers, advertisers or Brave itself. It gauges your interest chiefly by the content of websites you visit while browsing. \n\nThere’s also a machine learning aspect to the browser that measures your engagement with the ad and pays you for your attention. \n\nI’ve been using the browser on mobile and desktop solely for its speed and adblocking capabilities. I haven’t seen an ad on YouTube or even pornhub for a whileI don't think others will hop in since drivers are not sustainable and creating a network now would be a big marketing push. Could maybe make something work but I doubt the juice is worth the squeeze. Would have to find some niche to stand out. Uber/Lyft are reliable, Juno supposedly shares profit betterSorry, ad blockers suck on mobile, and are used much less frequently, especially on iPhone.On some browsers, but they're not as good and used much less frequently, especially on iPhone.Lol. Fuck Brave and their shitty shakedown-style business tactics. Also, fuck them fom breaking websites by randomly selecting what JavaScript gets blocked -- like Pornhub's pagination buttons or YouTube's follow-up video recommendations. I want that shit to work, and Brave fails in that respect.        \n     \nLastly, you clearly have no idea how Google Ads works. They don't share any of their user's personal info with their advertisers. You're either shilling for Brave, lying for kicks, or just plain ignorant.That's just it, tho. Drivers sustain better with more apps. That's why they all drive for both Uber and Lyft. If there's a third or fourth option, the drivers also see the benefits of their marketing efforts. But, yeah, too many variables and way too much lucky timing required for me. I'm going to stick to randomly guessing if presidential tweets are going to blast my ass with uppies or blast my ass with downies. Cheers.Lol I’m not shilling anything. I don’t own any BAT. Just enjoy their product and saying eventually googles market dominance won’t be as prevalentSo..... brave just caught google using hidden web pages to give user data to advertisers.... so fuck google and their intrusive practices. I’ll take the occasional broken web sitehttps://www.google.com/amp/s/www.techspot.com/amp/news/81746-brave-browser-team-google-using-hidden-pages-circumvent.htmlI believe that...which makes you lying for kicks or just ignorant ¯\\\\\\_(ツ)_/¯ I'm usually the latter. Cheers.I call bullshit. Provide a legit source if you're going to make that level of outlandish crap.     \n      \nE: also, if you're talking about [this](https://www.techspot.com/news/81746-brave-browser-team-google-using-hidden-pages-circumvent.html), you're an idiot with shit reading comprehension and critical thinking skills. Lol.You must've missed my edit. That's the exact same link that I said you'd be an idiot to cite. Lmfao.    \n     \nThat accusation was made a year ago, and the \"hidden\" pages they \"found\" don't support their argument.     \n      \nBrave often levels such accusations in an attempt to gain traction and obfuscate what's actually happening. They lie to confuse idiots into using their shitty browser so that they can then push their own advertising. It's as scummy as business models get, and sooner or later someone's going to sue them into oblivion for it.     \n    \nIf you want to not lose money, I suggest you carefully consider [Google's response](https://www.tomshardware.com/news/brave-google-push-pages-violate-gdpr-privacy,40330.html) and ask yourself why the stock jumped for the last couple days despite Brave's releasing this \"evidence\" (lol) three days ago. Fuck everyone at Brave.", "linkFlairText": "Discussion", "totalAwardsReceived": 0}, {"id": "ky17ox", "stockTicker": "BBBY", "title": "$BBBY - triple buy rating. 50% intrinsic upside + the next biggest squeeze potential", "selfText": "Let’s face it, most of us missed gme. Of course gme will hit $500/share end of year, but for all other semi-retarded autist, lemme tell you why you should be buying $bbby right now before close. \n\n- Very well regarded Mark Tritton (former Target CMO) became a CEO just over a year ago. He’s the only the 3rd CEO and 1st outsider in the company’s history who’s very optimistic about a turnaround\n\n- they’ve sold non-core assets and expect to raise additional $350mm-$450mm in cash from non-core that will be pushed towards digital sales\n\n- Digital Comps up 94% YoY. Penetration online continues to grow drastically with a 31% annual growth rate\n\n- More digital means wider margins. Gross Margins increased from 32.2% to 35.4% which simply means they make 3% more on every sale which is huge. \n\n- They’ve increased the planned share buy-back from $675mm to $825mm in the next 3 years. That’s 1/3 of the fucking float which signals the confidence of the management \n\n- Haters might point Net income was negative. True, but it was mainly due to $2.469 billion NON recurring  restructuring cost. If we omit that cost, the net income over the past three years is +$500mm. \n\n- EV/EBITDA is 10.01 vs conservative 12.7 industry average at the time of this post. So that alone should put us at a fair value of $35/share today. Based on forward EBITDA for 2021, that’s $39/share in the next 12 months. And that’s not accounting for share buyback.\n\n\nSounds good right. But wait, there’s more\n\n\n-BBBY is the 5th most shorted stock over $1 billion MC with 68% of short float. You all know #1, the other 3 are garbage. Just like u/runrun8 pointed, Michael Burry is in, and YES, the fucking Melvin has the audacity to short this one too. \n\n-Our king retard Cramer is pushing it (by frequently interviewing the CEO and explicitly saying that $BBBY is the next squeeze)\n\nTLDR: 2000 shares + May 2021 $30 Calls 🚀🚀🚀 (Second time in my life I go ALL IN. I doubled my money the first time, look through post history)", "score": 25, "comment": "GME aint missed, this bitch is just getting started. stop trying to distract new retards. we should all be focusing on GMEHow are you going to say many missed gme, but that it’ll reach $500 EOY? lolGME hasn’t even squeezed yet lolAlready in.Wait your turn, GME’s not doneChecking in with 5 shares at $6.43 and 1 $21 call 05/21 that's up 150%! LOL ready for the 🚀🚀🚀I bought 25 shares on the margin I gained from my GME position exploding. \n\nFigured why not. Free money to make more free moneyThis actually seems like a really really good play. What calls do you recommend? I was eyeing the May 35cBought two calls this morning on the dip. \nAug 30c and Jan 2022 35c \n\nThey’re going to print 🚀🚀👍👍Already balls deepSo...GME or bbby ? Which one to buy ?let’s do it! 🚀🚀🚀🚀🚀🚀🚀Great DD. This makes me want to triple my position come TuesdayNo fuck this. People will sell there GME to get in on this. There's literally no more plays to yolo in until gme hits $100 for us Poor'sThis guy fucksThis is my first day looking at wsb, thinking of buying 5k worth of gme shares. What do you recon it will hit by mid 2021?You saw all the brand new accounts with no posts shilling for BB?\n\nWhile bears were naked selling like crazy to drive price down? After SEC stepped in to stop bears price suddenly stopped falling.\n Either just dumb BB pumpers or gay ass bear trying to get ppl to sell gme\nFucking gay ass bears' stop trying to distract new retards' hahahahaGME gang,\n\nSTOP downvoting me. I acknowledge that it will hit $500. $bbby is for another way to fuck Melvin you retardsThis. OP is Melvin employee undercover and trying to divide the gme focusGME. 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀$100+ easily. fuck dude it could be almost there by next week depending on the short squeeze. this bitch is gonna fly. throw that shit in now while the dip is still herewe fuck one at a time sweet retardFuck them with gme first, and only after that fuck them again with bbby. Whats not to understand retard?I'm a slave with no will of my own, do I buy $30k worth of GME or $60k with leverage?Why not double penetration at the same time?60k with leverage. Thank me on TuesdayBetter 30k shares so you won't get margin call in case of a drop\"Scared money don't make no money\" - Warren Buffett.\n\nShould be self-explanatory. Or would you dare to doubt the Buffalo?Because im poor and gfs bf wont give me any more moneyWhat are these downvotes? Envious paper hands or Melvin's minions?pretty much. moon time bitches", "linkFlairText": "DD", "totalAwardsReceived": 1}, {"id": "g449s0", "stockTicker": "TSLA", "title": "$TSLA 4/24 685P", "selfText": "I’m buying one contract expiring on 4/24 that cost me around $1,300. Fun fact that’s over 5% of my portfolio, YOLO! The bulls made me do it.  Elon and his butt buddies in this sub have been doing way too much LSD. That was my due diligence. 🙏\n\nThe 🐻🌈 shall claim their 👑 once more!", "score": 0, "comment": "F\n\nDon’t fuck with Elon. \n\nHere is a list of people who fuck with Elon and come out on top:\n\nThai ~~pedo~~ guy\n\nSex robot lady\n\nThat’s it. It’s not really good company.BAN this negative karma fuck wit. This ain't DD. Go back to your Luckin shares at $35 from the cucks at r/investingPuts will fuck you with TSLAOnly 5% of your portfolio and you call that a yolo??Rule number 1. Never bet against ElonChange this to shitpostplease reflair to shitpostWhy the f not! I’m in with you. I will get 690c 4/24 1contOver 5%? What are you doing with the other 95%?You’re dating this put way too soon.This post was flaired as DD so it's on the DD list. Find more fresh WSB DD here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3ADD&restrict_sr=on&t=da.\n\nDon't misuse DD flair. No shitposts, short and vague guesses, unexplained news links, etc. Please change the flair if this isn't DD. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*!remindme 1 weekI've been consistently wrong about TSLA and I wouldn't do this trade so maybe it's a good trade?RIP to your portfolio. But seriously, I’d at least pick a long dated expiry date like in MayI’m fine with you losing like this, it takes a certain amount of people to torch their money in order to have an options market like we do. My question is: why only 5%? You should lose at least 60% of your portfolio next week.SO HOW DID THIS GOWhy not both?  Buy a put and call. It can go either way. \n\nTesla car owners aren’t the people getting laid off (at least, not entirely).  These people can never afford an $80k car anyways. Even a $40k car is entry luxury level. \n\nThe owners are the programmers working from home. Or the senior management that can work from home, and will jump to another company, if they lose their job. Or the small business owners that can mint cash, once this crisis is over.\n\nAlso, because of Tesla’s online ordering, then you don’t need to visit a dealership. \n\nAnd since it’s electric, it has less need for maintenance, so you don’t need to visit a mechanic. Perfect for the stay-at-home pandemic. \n\nTheir target market has always been the upper class, and white collar workers.Automod wya?FFFTsla is fierce the strongest of the bullsProof or I own $100,000,000 of 800CRemindMe! 6 daysBetter off shorting 2 sharesSometimes you have to learn the hard wayDid you dump on Wednesday or hold?What’s the payout on that 1300?  Not too sure how calls work.Pedo guy did not come out on topShort shorts guy Davin EinhornElon next to godFuck you nerd. That was a big brain move to write off all my gains in 2020. Go get laid.Options = yolo\n\nEdit: it’s gambling guys don’t kid yourselfRule number 2: Bet against ElonI bought tesla puts on friday.\nI was shivering in my bed that I almost shit my pants, I hope papa elon can fix my butt.We are going to be printing money. We will bring the bag home to momma! 💰Getting 0.3% interest with Robinhood cash management.I never play with options it’s all in long term holds. I own a lot of SMH, ENPH, DIS, SDGR, SNE, MSFT, ALLY, ATVI and a few other positionsHe should date me insteadI will be messaging you in 6 days on [**2020-04-26 10:09:43 UTC**](http://www.wolframalpha.com/input/?i=2020-04-26%2010:09:43%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/wallstreetbets/comments/g449s0/tsla_424_685p/fnvf5ho/?context=3)\n\n[**2 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fwallstreetbets%2Fcomments%2Fg449s0%2Ftsla_424_685p%2Ffnvf5ho%2F%5D%0A%0ARemindMe%21%202020-04-26%2010%3A09%3A43%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20g449s0)\n\n*****\n\n|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|Believe it or not I’m only down 6% year to date. I would be in the green this year if it wasn’t for Luckin Coffee, rip. I posted in one of the comments the majority of my long term holdings.What strike and expiration would u do for a call and puts?What your problem? ‘Must be a bull, rip.I held and it expired worthless. Rip1. He bought a put not a call.\n\n2. The payout depends on the stock price on 4/24 (When the option expires). Stock needs to be $130 less than $685 for OP to start making money.https://www.optionsprofitcalculator.com/But Finkle is Einhorn!Lol. I hope you sold on Tuesday.\n\nAlso: https://www.investopedia.com/terms/w/washsalerule.aspNice moveTesla is up for 10 straight heterosexual days. Stonks don’t move this way. Time to print. This shit goes down to 650 we will bank a grand or so, better than nothingNope, it’s in Ally Invest. I did however open up a Robinhood account just to play this put. This is a risky ass play so I figured it had to be done on Robinhood. 😂Stay away from my man bitchI'd wait after earnings and buy monthly callsThis is flaired as DD and this is as far from  DD as you can get you retarded fuck get the fuck out of hereCheck this out.^^^I did not. I still have to contract. I need tomorrow to be red as hell 🙏😂Tesla likes to do some magic shuffling for earnings, expecting a brief pop (”beating Lowered expectations”), then a equity raise as soon as possible (Dilution = stonks go up on retail optimism) and maybe a week after that the big lads will begin dumping.\n\nCould take awhile.\n\nAlternative thesis: California extend shutdown to mid/end of May and fucks over Tesla, causing a rout?\n\nOr the equity raise require such a large % rebate that it dumps the stock to 600 or something.Get laid bro... you’re the horniest bull on this subreddit 😂Thanks boss.", "linkFlairText": "DD", "totalAwardsReceived": 0}, {"id": "a1dazl", "stockTicker": "AMZN", "title": "$AMZN Traditional Bull Trap, same goes for $AAPL $FB & $NFLX -- Caution", "selfText": "", "score": 4, "comment": "once line 1 crosses over line 2 you know you are about to be a billionaire Every bull trap looks like a bull trap until it doesn’t anymore You're all fighting cause you're all looking to trade different time-frames. The day trader guys might be very right that it could pop in the next day or two AND the OP could also be right if AMZN tests that MA from underneath a month from now then drops. \n\nBe more specific in your timeframe if you're gonna slapfight damnit!Switch to the Black theme in WeBullur just making all this shit up aren't you?how can you tell it's a bull trap from the chart?SCOTTY DOESNT KNOW ! SCOTTY DOESNT KNOW ! \n\nAnd you’re scotty$2200 here we come!!How is apple a bull trap? It’s at a PE ratio of 15. the magic mspaint lines reveal all!I'm a TA trader but I'm sorry this is really bad TA you're posting.\n\nFirst off TA is much clearer on the daily chart. The weekly chart doesn't show enough information to see the trap form.\n\nYou need to let the bull trap form first. Looking at the amzn chart on the DAILY, it looks more like a bullish pattern ready to break out.\n\nAlso it's fucking Amazon man. Literally the biggest bull. \n\nWith that said.. I believe Amazon will go down in the long term this year, but that's purely speculation not based in TA.\n\nGood luck[deleted]Pls GE bull trap too...Delet this famThis lying cunt jus tryin’ to buy calls on the cheap.\n\n@Bitch-ass OP: nice try but you suck at being convincing worse than your moms sucking my asshole post-shit, no-wipe, thai-hot Pad Thai diet.\n\nMods, ban this bitch OP for dishonoring us with such a *lousy* attempt at shilling bs. He should *at least* have the goddamn common courtesy to put forth half the effort of your typical Goldman analyst downgrade. Unacceptable.Good ideaOp doesn’t know... he pretends he knows cz he’s fag lolIt broke multi-year up trend line, will touch that line on the underside and resume downtrendAll the bullish idiotic backlash is making me so much more confident, actuallyTell that PE logic to MU longs Standard trailing PE is a pretty terrible fundamental valuation metric. It's just easy to understand and calculate. \n\nForward PE is what your looking for hereWhat are you talking about? Weekly and monthly charts are great, there is no one best way. Regardless, we are at resistance with a doji on the daily. The market is going DOWN. Not speculation, facts.This is why I just wait to go long for years, good luckHoly FuckLmaoJust gonna make another great call, fam> bitch ass-op\n\n***\n\n^(Bleep-bloop, I'm a bot. This comment was inspired by )^[xkcd#37](https://xkcd.com/37)No it won't. It's Apple, not fucking \"NBEV\".  \n\n\nYou realize it could have the same year it just had and in two years the graph will look like this, right?  \n\n\n[https://i.imgur.com/SvRv5Uq.png](https://i.imgur.com/SvRv5Uq.png)What the fuck does that even mean? Not even a month ago it was back at this price on sharp upward movement. \n\nYou TA people sound like fucking retards. \n\nIf Amazon gets Jedi and 10 billion dollars will it gap up? Stupid fuck.you don't even have a position though lets be honest. prove me wrong breh so if you think tomorrow is another green day and there’s massive momentum amazon won’t get carried and break through your magical lines like a black man on pcp?😐🔫If your trading the weekly go ahead. Using both charts work best. On the daily, the doji looks to me like it could flag for a few days then breakout.\n\nRegardless this week is all about the China deal. If nothing happens, then the vix drops and stocks pop. If a deal is made then stocks RIP till 2019 Feb.I hear you. I bought most of my AMZN shares in 2014 - between $300 and $350. I usually make $2k a month selling calls — but every now and then I get assigned and have to rebuy. Still thinking might stay under 1695 until next weekBest call *is* a call. Return some tomorrow, then steady climb as institutions establish positions through the run up to 4q earnings.\n\n$AMZN rockets in flight !!!  (*pop*)YawnLol how biased are you? Resorting to insults like a child, pathetic...I'm net short by holding cash, I don't retardedly buy 50 contracts, sorryI buy stock long. You wanna buy options, it's up to you. I'm looking at 2-5 year time framesGreat buy! Probably never see that price againBiased. Uses TA.   What?  I’m biased because it’s gone up 1650+ twice this month.\n\nSo it makes no sense.thought so.  that means you don't believe in your own lil TA chart. your 'position' is not having a position, meaning you are not confident enough in your own 'research' to short AMZN. you're telling us AMZN is a bull trap, i.e. it's about to crash down again. yet... you dont actually believe this very strongly, because you dont have a short position. \n\n> I'm net short by holding cash\n\nYou are adorableSo you are poor and since you don’t have skin in the game you are just guessing. Nice. PussyYawnLol then why are you here? I agree this may be a bull trap though. lol I hope not! I did stop buying more. Now I just throw all my money at TSLAOkay, let's chat in a week or twoThis is a standard chart, I didn't make it. I don't short anythingYes I'm poor, lmao do you hear yourself? Sounds like you're guessing on some calls.I'm interested to buy TSLA during recession, hopefully in the mid-high hundreds and AMZN around 1000Will the downward trend go back up?k, you screenshotted this chart to share with everyone saying it's showing that AMZN is about to crash. \n\nbut you dont actually believe this, otherwise you'd aim to profit on it with a short. \n\nsolid post OP“I'm net short by holding cash, I don't retardedly buy 50 contracts, sorry” http://www.reddit.com/r/wallstreetbets/comments/a1dazl/amzn_traditional_bull_trap_same_goes_for_aapl_fb/eaozotr\n\n\n-\nTalks about guessing. Uses TA. Gtfo plebNo this is the apocalypse were done forI'm trying to help people who don't use TA or understand quantitative easing. Why does it matter if I'm shorting or waiting to buy a dip to you? It's my strategy, deal with itLol bro the market is about to own you, one gapfill left at 25,600 or sobecause it's worthless to share strategies and 'tips' that you dont actually believe in enough to trade on yourself. you're basically paper trading here. Man you're a fuckin moron, take careowie that hurt. but you're a paper trading fruitcup so we good. take care brosef <3You:\n\n>Resorting to insults like a child, pathetic...\n\nAlso you:\n\n>Man you're a fuckin moron\n\nB I G O O F\n\nGood luck taking on every trade you theorize both short and long, you'll be broke in 2019Good point. Wait til longs get torched tomorrow... I'm getting flamed by bafoons. Hard to tolerate.thanks for looking out dude. youre a real pro with yuge gains ", "linkFlairText": "Technicals", "totalAwardsReceived": 0}, {"id": "gg1iu1", "stockTicker": "TWNK", "title": "$TWNK simply will print.", "selfText": "AH keeps going up to 12.50, then opens and crashes back down. I'm holding 12.5c 5/15 and 12.5c 6/19, that shit is going to PRINTTTTTT retards. Get in on this shit.\n\nEarnings the 19th, killing the game. All these fat people inside eating twinkies, will exceed expectations, and fucking MOOOOOON\n\nTL;DR $TWNK 12.5c 5/22 10c 5/15 12.5c 5/29", "score": 0, "comment": "Googled “twink”. Not what I had in mind when I read “cream filled”.The losers trying to pump this here are pathetic. Ban.OP is highEarnings were this morning my friend.  \n\n\nI believe in this because they had gone down since the 30th for no reason.  As long as everything else continues rebounding, this will too.i ditched my calls for a decent loss.  goodluck.I thought earnings were today?http://www.hostessbrands.com/events-and-presentations/presentations\n\nEarnings were this morning lolOp = gay retardThis post was flaired as a YOLO so it's on the YOLO list. Find more YOLOs here - https://ns.reddit.com/r/wallstreetbets/search?sort=new&q=flair%3AYOLO&restrict_sr=on&t=da. \n\nYOLO flair is for dank trades only. If you misused the flair please change it. Mods have been notified of this thread.\n\nNot sure which flair to use? Check out our guide to post flairs here - https://www.reddit.com/r/wallstreetbets/wiki/linkflair.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*Sounds scaryDo they produce the young bears?If it manages to fucking stay up during the day that’d be greatThey make buns for McDonalds. I'm waiting for my $100 in puts to be the ones printing.BanThanks for ruining my life. I can’t unsee that.I'm up at the momentSameThey were lol. RH shows as earnings on the 19th lmao. OP didn't do any research at all. Simple Google search would show when the earnings really were.Yup. and as is required with all good news, TWNK will go down on MondayDamn, RH lying to me then. It says \"Available 5/19\" on thereThen he is in the right spot.why would you have to google twink lolYeah like you haven’t seen it at 1am every day this weekBecause the internet told me toPlease do NOT assume everyone here is just like you.Hahaha i love you mother fuckers.", "linkFlairText": "YOLO", "totalAwardsReceived": 0}]